cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x4_SVD.xml
				<register>
					<name>CHAR10</name>
					<description>Conversion Characteristic 0 and 1 Setup</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CHR0GN</name>
							<description>Conversion Characteristic 0 Gain. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNITY</name>
									<description>The on-chip PGA gain is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALF</name>
									<description>The on-chip PGA gain is 0.5.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR0RPT</name>
							<description>Conversion Characteristic 0 Repeat Counter. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ACC1</name>
									<description>Accumulate one sample.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC4</name>
									<description>Accumulate four samples.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC8</name>
									<description>Accumulate eight samples.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC16</name>
									<description>Accumulate sixteen samples.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC32</name>
									<description>Accumulate thirty-two samples (10-bit mode only).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC64</name>
									<description>Accumulate sixty-four samples (10-bit mode only).</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR0LS</name>
							<description>Conversion Characteristic 0 Left-Shift Bits. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CHR0RSEL</name>
							<description>Conversion Characteristic 0 Resolution Selection. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>B10</name>
									<description>Select 10-bit Mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>B12</name>
									<description>Select 12-bit Mode (burst mode must be enabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR0WCIEN</name>
							<description>Conversion Characteristic 0 Window Comparator Interrupt Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable window comparison interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled window comparison interrupts.  The window comparator will be used to check the ADC result on channels that use this characteristic.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR1GN</name>
							<description>Conversion Characteristic 1 Gain. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNITY</name>
									<description>The on-chip PGA gain is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALF</name>
									<description>The on-chip PGA gain is 0.5.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR1RPT</name>
							<description>Conversion Characteristic 1 Repeat Counter. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ACC1</name>
									<description>Accumulate one sample.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC4</name>
									<description>Accumulate four samples.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC8</name>
									<description>Accumulate eight samples.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC16</name>
									<description>Accumulate sixteen samples.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC32</name>
									<description>Accumulate thirty-two samples (10-bit mode only).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC64</name>
									<description>Accumulate sixty-four samples (10-bit mode only).</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR1LS</name>
							<description>Conversion Characteristic 1 Left-Shift Bits. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CHR1RSEL</name>
							<description>Conversion Characteristic 1 Resolution Selection. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>B10</name>
									<description>Select 10-bit Mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>B12</name>
									<description>Select 12-bit Mode (burst mode must be enabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR1WCIEN</name>
							<description>Conversion Characteristic 1 Window Comparator Interrupt Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable window comparison interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled window comparison interrupts.  The window comparator will be used to check the ADC result on channels that use this characteristic.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Output Data Word</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Output Data Word. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WCLIMITS</name>
					<description>Window Comparator Limits</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WCLT</name>
							<description>Less-Than Window Comparator Limit. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>WCGT</name>
							<description>Greater-Than Window Comparator Limit. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ACC</name>
					<description>Accumulator Initial Value</description>
					<addressOffset>0x80</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ACC</name>
							<description>Accumulator Initial Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x90</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WCI</name>
							<description>Window Compare Interrupt. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A window compare interrupt has not occurred. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A window compare interrupt occurred. Write: Force a window compare interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCCI</name>
							<description>Single Conversion Complete Interrupt. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A single data conversion interrupt has not occurred. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A single data conversion interrupt occurred. Write: Force a single data conversion interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SDI</name>
							<description>Scan Done Interrupt. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A scan done interrupt has not occurred. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A scan done interrupt occurred. Write: Force a scan done interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FORI</name>
							<description>FIFO Overrun Interrupt. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A data FIFO overrun interrupt has not occurred. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A data FIFO overrun interrupt occurred. Write: Force a data FIFO overrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FURI</name>
							<description>FIFO Underrun Interrupt. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: A data FIFO underrun interrupt has not occurred. Write: Clear the interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: A data FIFO underrun interrupt occurred. Write: Force a data FIFO underrun interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FIFOSTATUS</name>
					<description>FIFO Status</description>
					<addressOffset>0xa0</addressOffset>
					<resetValue>0x00000010</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FIFOLVL</name>
							<description>FIFO Level. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DPSTS</name>
							<description>Data Packing Status. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOWER</name>
									<description>The next ADC conversion will be written to the lower half-word.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPPER</name>
									<description>The next ADC conversion will be written to the upper half-word.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRDYF</name>
							<description>Data Ready Flag. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>New data is not produced yet.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>New data is ready.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
