cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x4_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>AES_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>AES_0</groupName>
			<baseAddress>0x40027000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>AES0_IRQn</name>
				<value>42</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XFRSTA</name>
							<description>AES Transfer Start. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>START</name>
									<description>Start the AES operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>KEYCPEN</name>
							<description>Key Capture Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable key capture.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable key capture.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDMD</name>
							<description>Encryption/Decryption Mode. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DECRYPT</name>
									<description>AES module performs a decryption operation</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENCRYPT</name>
									<description>AES module performs an encryption operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SWMDEN</name>
							<description>Software Mode Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable software mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable software mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BEN</name>
							<description>Bypass AES Operation Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not bypass AES operations.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Bypass AES operations.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XOREN</name>
							<description>XOR Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>XOR_DISABLED</name>
									<description>Disable the XOR paths.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XOR_INPUT</name>
									<description>Enable the XOR input path, disable the XOR output path.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XOR_OUTPUT</name>
									<description>Disable the XOR input path, enable the XOR output path.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCTREN</name>
							<description>Hardware Counter Mode Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable hardware counter mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable hardware counter mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HCBCEN</name>
							<description>Hardware Cipher-Block Chaining Mode Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable hardware cipher-block chaining (CBC) mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable hardware cipher-block chaining (CBC) mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>KEYSIZE</name>
							<description>Keystore Size Select. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>KEY128</name>
									<description>Key is composed of 128 bits.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEY192</name>
									<description>Key is composed of 192 bits.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>KEY256</name>
									<description>Key is composed of 256 bits.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERRIEN</name>
							<description>Error Interrupt Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the error interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the error interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCIEN</name>
							<description>Operation Complete Interrupt Enable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the operation complete interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the operation complete interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>AES Debug Mode. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the AES module to halt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN</name>
									<description>The AES module will continue to operate while the core is halted in debug mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET</name>
							<description>Module Soft Reset. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>AES module is not in soft reset.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>AES module is in soft reset and none of the module bits can be accessed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>XFRSIZE</name>
					<description>Number of Blocks</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XFRSIZE</name>
							<description>Transfer Size. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DATAFIFO</name>
					<description>Input/Output Data FIFO Access</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DATAFIFO</name>
							<description>Input/Output Data FIFO Access. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>XORFIFO</name>
					<description>XOR Data FIFO Access</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>XORFIFO</name>
							<description>XOR Data FIFO Access. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY0</name>
					<description>Hardware Key Word 0</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY0</name>
							<description>Hardware Key Word 0. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY1</name>
					<description>Hardware Key Word 1</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY1</name>
							<description>Hardware Key Word 1. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY2</name>
					<description>Hardware Key Word 2</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY2</name>
							<description>Hardware Key Word 2. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY3</name>
					<description>Hardware Key Word 3</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY3</name>
							<description>Hardware Key Word 3. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY4</name>
					<description>Hardware Key Word 4</description>
					<addressOffset>0x80</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY4</name>
							<description>Hardware Key Word 4. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY5</name>
					<description>Hardware Key Word 5</description>
					<addressOffset>0x90</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY5</name>
							<description>Hardware Key Word 5. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY6</name>
					<description>Hardware Key Word 6</description>
					<addressOffset>0xa0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY6</name>
							<description>Hardware Key Word 6. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWKEY7</name>
					<description>Hardware Key Word 7</description>
					<addressOffset>0xb0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWKEY7</name>
							<description>Hardware Key Word 7. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWCTR0</name>
					<description>Hardware Counter Word 0</description>
					<addressOffset>0xc0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWCTR0</name>
							<description>Hardware Counter Word 0. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWCTR1</name>
					<description>Hardware Counter Word 1</description>
					<addressOffset>0xd0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWCTR1</name>
							<description>Hardware Counter Word 1. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWCTR2</name>
					<description>Hardware Counter Word 2</description>
					<addressOffset>0xe0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWCTR2</name>
							<description>Hardware Counter Word 2. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HWCTR3</name>
					<description>Hardware Counter Word 3</description>
					<addressOffset>0xf0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HWCTR3</name>
							<description>Hardware Counter Word 3. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x100</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DURF</name>
							<description>Input/Output Data FIFO Underrun Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No input/output data FIFO underrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An input/output data FIFO underrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DORF</name>
							<description>Input/Output Data FIFO Overrun Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No input/output data FIFO overrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An input/output data FIFO overrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XORF</name>
							<description>XOR Data FIFO Overrun Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>No XOR data FIFO overrun.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>An XOR data FIFO overrun has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DFIFOLVL</name>
							<description>Input/Output Data FIFO Level. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>Input/Output data FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1WORD</name>
									<description>Input/Output data FIFO contains 1 word.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2WORDS</name>
									<description>Input/Output data FIFO contains 2 words.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3WORDS</name>
									<description>Input/Output data FIFO contains 3 words.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>Input/Output data FIFO contains 4 words (full).</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XFIFOLVL</name>
							<description>XOR Data FIFO Level. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>XOR data FIFO is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1WORD</name>
									<description>XOR data FIFO contains 1 word.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2WORDS</name>
									<description>XOR data FIFO contains 2 words.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3WORDS</name>
									<description>XOR data FIFO contains 3 words.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL</name>
									<description>XOR data FIFO contains 4 words (full).</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSYF</name>
							<description>Module Busy Flag. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AES module is not busy.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AES module is completing an operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERRI</name>
							<description>Error Interrupt Flag. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AES error interrupt has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AES error interrupt has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCI</name>
							<description>Operation Complete Interrupt Flag. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>AES operation complete interrupt has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>AES operation complete interrupt occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
