cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x4_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>I2S_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>I2S_0</groupName>
			<baseAddress>0x4003a000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2S0RX_IRQn</name>
				<value>40</value>
			</interrupt>
			<interrupt>
				<name>I2S0TX_IRQn</name>
				<value>41</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>TXCONTROL</name>
					<description>Transmit Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x02000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FSGEN</name>
							<description>DFS Generator Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the internal DFS generator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the internal DFS generator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FSSEN</name>
							<description>DFS Synchronize Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The internal DFS generator starts immediately when FSGEN is set to 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Synchronize the rising edge of the internally generated WS signal from the DFS generator to the rising edge of the external WS input signal.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DDIS</name>
							<description>Transmit Delay Disable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>The first data bit is sent on the second or later rising edge of SCK after WS changes.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The first data bit is sent on the first rising edge of SCK after WS changes.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FSDEL</name>
							<description>Transmit Initial Phase Delay. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>FSSRCSEL</name>
							<description>Transmit Frame Sync Source Select. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FSIN_EXT</name>
									<description>The word select or frame sync is input from the WS pin.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FSIN_INT</name>
									<description>The word select or frame sync is input from the internal DFS generator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILLSEL</name>
							<description>Transmit Data Fill Select. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZEROS</name>
									<description>Send zeros during unused bit cycles.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONES</name>
									<description>Send ones during unused bit cycles.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SIGN</name>
									<description>Send the sign bit of the current sample (MSB-first format) or last sample (LSB-first format) during unused bit cycles.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RANDOM</name>
									<description>Send pseudo-random data generated by an 8-bit LFSR during unused bit cycles.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>JSEL</name>
							<description>Transmit Data Justification Select. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LEFT</name>
									<description>Use left-justified or I2S-style formats.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RIGHT</name>
									<description>Use right-justified format.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FSINVEN</name>
							<description>Transmit WS Inversion Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Don't invert the WS signal. Use this setting for I2S format.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the WS signal.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCLKINVEN</name>
							<description>Transmit SCK Inversion Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not invert the transmitter bit clock.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the transmitter bit clock.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ORDER</name>
							<description>Transmit Order. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LEFT_RIGHT</name>
									<description>Left sample transmitted first, right sample transmitted second. Use this setting for I2S format.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RIGHT_LEFT</name>
									<description>Right sample transmitted first, left sample transmitted second.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MBSEL</name>
							<description>Transmit Mono Bit-Width Select. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>8BITS</name>
									<description>8 bits are sent per mono sample.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9BITS</name>
									<description>9 bits are sent per mono sample.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16BITS</name>
									<description>16 bits are sent per mono sample.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>24BITS</name>
									<description>24 bits are sent per mono sample.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32BITS</name>
									<description>32 bits are sent per mono sample.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXEN</name>
							<description>Transmitter Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the I2S transmitter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the I2S transmitter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TXMODE</name>
					<description>Transmit Mode</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CYCLE</name>
							<description>Transmit Clock Cycle Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>START</name>
							<description>Transmit Start Control. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SLOTS</name>
							<description>Transmit Drive Select. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DEDIS</name>
							<description>Transmit Drive Early Disable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Drive the output during every cycle of the transmitter's assigned slot(s), including the last clock cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Drive the output for every cycle of the transmitter's assigned slot(s), except for the last clock cycle of the last slot.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIMD</name>
							<description>Transmit Drive Inactive Mode. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ZERO</name>
									<description>Drive zero on the data output pin during non-active slots.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_Z</name>
									<description>Don't drive the data output pin. The data output pin is tristated.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TDMEN</name>
							<description>Transmit Time Division Multiplexing Enable. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the time division multiplexing (TDM) feature.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the time division multiplexing (TDM) feature.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FSDUTY</name>
					<description>Frame Sync Duty Cycle</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FSLOW</name>
							<description>Frame Sync Low Time. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>FSHIGH</name>
							<description>Frame Sync High Time. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXCONTROL</name>
					<description>Receive Control</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00010000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FSDEL</name>
							<description>Receive Initial Phase Delay. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>JSEL</name>
							<description>Receive Data Justification. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LEFT</name>
									<description>Use left-justified or I2S-style formats.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RIGHT</name>
									<description>Use right-justified format.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DDIS</name>
							<description>Receive Delay Disable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>The first data bit is captured on the second or later rising edge of SCK after WS changes.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>The first data bit is captured by the receiver on the first rising edge of SCK after WS changes.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FSINVEN</name>
							<description>Receive WS Inversion Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Don't invert the WS signal. Use this setting for I2S format.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the WS signal.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCLKINVEN</name>
							<description>Receive SCK Inversion Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not invert the receiver bit clock.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the receiver bit clock.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ORDER</name>
							<description>Receive Order. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LEFT_RIGHT</name>
									<description>Left sample received first, right sample received second. Use this setting for I2S format.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RIGHT_LEFT</name>
									<description>Right sample received first, left sample received second.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MBSEL</name>
							<description>Receive Mono Bit-Width Select. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>8BITS</name>
									<description>8 bits are received per mono sample.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9BITS</name>
									<description>9 bits are received per mono sample.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16BITS</name>
									<description>16 bits are received per mono sample.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>24BITS</name>
									<description>24 bits are received per mono sample.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32BITS</name>
									<description>32 bits are received per mono sample.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FSSRCSEL</name>
							<description>Receive Frame Sync Source Select. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FSIN_EXT</name>
									<description>The word select or frame sync is input from the WS pin.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FSIN_INT</name>
									<description>The word select or frame sync is input from the internal DFS generator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXEN</name>
							<description>Receive Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the I2S receiver.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the I2S receiver.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RXMODE</name>
					<description>Receive Mode</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CYCLE</name>
							<description>Receive Clock Cycle Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>START</name>
							<description>Receive Start Control. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SLOTS</name>
							<description>Receive Drive Select. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>TDMEN</name>
							<description>Receive Time Division Multiplexing Enable. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the time division multiplexing (TDM) feature.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the time division multiplexing (TDM) feature.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
