cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x4_SVD.xml
				<register>
					<name>XBAR0L</name>
					<description>Crossbar 0 Control (Low)</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>USART0EN</name>
							<description>USART0 Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART0 RX and TX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART0 RX and TX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART0FCEN</name>
							<description>USART0 Flow Control Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART0 flow control on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART0 flow control on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART0CEN</name>
							<description>USART0 Clock Signal Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART0 clock on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART0 clock on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI0EN</name>
							<description>SPI0 Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI0 SCK, MISO, and MOSI on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI0 SCK, MISO, and MOSI on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI0NSSEN</name>
							<description>SPI0 NSS Pin Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI0 NSS on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI0 NSS on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART1EN</name>
							<description>USART1 Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART1 RX and TX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART1 RX and TX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART1FCEN</name>
							<description>USART1 Flow Control Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART1 flow control on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART1 flow control on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART1CEN</name>
							<description>USART1 Clock Signal Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART1 clock on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART1 clock on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPCA0EN</name>
							<description>EPCA0 Channel Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>Disable all EPCA0 channels on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STD_CEX0</name>
									<description>Enable EPCA0 STD_CEX0 on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STD_CEX0_1</name>
									<description>Enable EPCA0 STD_CEX0 and STD_CEX1 on Crossbar 0.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STD_CEX0_2</name>
									<description>Enable EPCA0 STD_CEX0, STD_CEX1, and STD_CEX2 on Crossbar 0.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STD_CEX0_3</name>
									<description>Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, and STD_CEX3 on Crossbar 0.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STD_CEX0_4</name>
									<description>Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, STD_CEX3, and STD_CEX4 on Crossbar 0.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STD_CEX0_5</name>
									<description>Enable EPCA0 STD_CEX0, STD_CEX1, STD_CEX2, STD_CEX3, STD_CEX4, and STD_CEX5 on Crossbar 0.</description>
									<value>6</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCA0EN</name>
							<description>PCA0 Channel Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>Disable all PCA0 channels on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0</name>
									<description>Enable PCA0 CEX0 on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0_1</name>
									<description>Enable PCA0 CEX0 and CEX1 on Crossbar 0.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCA1EN</name>
							<description>PCA1 Channel Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>Disable all PCA1 channels on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0</name>
									<description>Enable PCA1 CEX0 on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CEX0_1</name>
									<description>Enable PCA1 CEX0 and CEX1 on Crossbar 0.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EECI0EN</name>
							<description>EPCA0 ECI Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable EPCA0 ECI on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable EPCA0 ECI on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ECI0EN</name>
							<description>PCA0 ECI Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable PCA0 ECI on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable PCA0 ECI on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ECI1EN</name>
							<description>PCA1 ECI Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable PCA1 ECI on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable PCA1 ECI on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2S0TXEN</name>
							<description>I2S0 TX Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2S0 TX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2S0 TX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2C0EN</name>
							<description>I2C0 Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2C0 SDA and SCL on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2C0 SDA and SCL on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0SEN</name>
							<description>Comparator 0 Synchronous Output (CMP0S) Enable. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 0 Synchronous Output (CMP0S) on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 0 Synchronous Output (CMP0S) on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0AEN</name>
							<description>Comparator 0 Asynchronous Output (CMP0A) Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 0 Asynchronous Output (CMP0A) on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 0 Asynchronous Output (CMP0A) on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1SEN</name>
							<description>Comparator 1 Synchronous Output (CMP1S) Enable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 1 Synchronous Output (CMP1S) on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 1 Synchronous Output (CMP1S) on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1AEN</name>
							<description>Comparator 1 Asynchronous Output (CMP1A) Enable. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 1 Asynchronous Output (CMP1A) on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 1 Asynchronous Output (CMP1A) on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMR0CTEN</name>
							<description>TIMER0 T0CT Enable. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable TIMER0 CT on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable TIMER0 CT on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMR0EXEN</name>
							<description>TIMER0 T0EX Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable TIMER0 EX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable TIMER0 EX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMR1CTEN</name>
							<description>TIMER1 T1CT Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable TIMER1 CT on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable TIMER1 CT on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMR1EXEN</name>
							<description>TIMER1 T1EX Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable TIMER1 EX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable TIMER1 EX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>XBAR0H</name>
					<description>Crossbar 0 Control (High)</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UART0EN</name>
							<description>UART0 Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable UART0 RX and TX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable UART0 RX and TX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UART0FCEN</name>
							<description>UART0 Flow Control Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable UART0 flow control on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable UART0 flow control on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UART1EN</name>
							<description>UART1 Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable UART1 RX and TX on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable UART1 RX and TX on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1EN</name>
							<description>SPI1 Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI1 SCK, MISO, and MOSI on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI1 SCK, MISO, and MOSI on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1NSSEN</name>
							<description>SPI1 NSS Pin Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI1 NSS on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI1 NSS on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI2EN</name>
							<description>SPI2 Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI2 SCK, MISO, and MOSI on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI2 SCK, MISO, and MOSI on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI2NSSEN</name>
							<description>SPI2 NSS Pin Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI2 NSS on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI2 NSS on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AHBEN</name>
							<description>AHB Clock Output Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the AHB Clock / 16 output on Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the AHB Clock / 16 output on Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XBAR0EN</name>
							<description>Crossbar 0 Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Crossbar 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Crossbar 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
